_posts/2011-11-19-for-sugary-object-oriented-js.html
---
layout: post
title:  Yay for Sugary JavaScript OO
snip:   Why classes when you can have expressive prototypes?
redirect_from:
  - /2011/11/19/for-sugary-object-oriented-js.html
---


<p>
So, <a href="http://killdream.github.com/blog/2011/10/understanding-javascript-oop/index.html">JavaScript is an object oriented language</a> and all that, we have
discussed it previously to length, and I have quite expressed how
confusing and rough all the primitives the language provides are when it
comes to dealing with object composition and behaviour sharing — which
is just no good for a prototypical language.
</p>
<p>
Well, the good thing is that we can provide our own abstractions for
this overtly dynamic object orientation semantics through libraries,
which is what I have been doing for a while. And now that <a href="https://github.com/killdream/boo">Boo</a> has gained
some shape and use, it's time to release it officially.
</p>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Why? Oh god WHY?</h2>
<div class="outline-text-2" id="text-1">


<p>
So, what's this <code>Boo</code> thing I'm talking about?
</p>
<p>
Well, my dearest friend, <code>Boo</code> is my attempt at bringing some sugar and
sort-of declarative syntax for defining objects in JavaScript, which
makes the structuring of programs easier to follow and reason about.
</p>
<p>
So, instead of the ugly, factory-ish approach:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">Animal</span>() { <span style="color: #75766A;">/* </span><span style="color: #75766A;">... */</span> }
<span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">Cat</span>()    { <span style="color: #75766A;">/* </span><span style="color: #75766A;">... */</span> }
Cat.<span style="color: #FA2573;">prototype</span> = Object.create(Animal.<span style="color: #FA2573;">prototype</span>)
Cat.<span style="color: #FA2573;">prototype</span>.say = <span style="color: #C48DFF;">function</span>() { <span style="color: #75766A;">/* </span><span style="color: #75766A;">... */</span> }
</pre>


<p>
You can have a sort-of declarative one that works entirely around
objects:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">Base</span>   = boo.Base
<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">Animal</span> = Base.derive({ <span style="color: #75766A;">/* </span><span style="color: #75766A;">Animal's properties here */</span> })
<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">Cat</span>    = Animal.derive({ <span style="color: #75766A;">/* </span><span style="color: #75766A;">Cat's properties here */</span> })
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">What Boo provides?</h2>
<div class="outline-text-2" id="text-2">


<p>
Boo is structured in three layers: mixins, inheritance and
syntactical-sugar. Each of these serve to a particular purpose, and build
upon the previous one — although you could say that the concepts
themselves are orthogonal, which makes them composable.
</p>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Mixins</h3>
<div class="outline-text-3" id="text-2-1">


<p>
On the basic level, <code>Boo</code> provides the developer with mixins and
data-objects — which are a specialised kind of mixins.
</p>
<p>
Mixins are parent-less objects that can be included in any object, at
any time. Data-objects do the same thing, but they're also a factory for
yielding the objects that will be included, which makes them a neat
thing for default objects and such.
</p>
<p>
The primitives <code>extend</code> and <code>merge</code> account for all of these:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">ring_data</span> = {
  items: [], max: 3,

  <span style="color: #67D9F0;">toData</span>: <span style="color: #C48DFF;">function</span>() {
    <span style="color: #C48DFF;">return</span> { items: [], max: <span style="color: #FA2573;">this</span>.max }}
}

<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">ring</span> = {
  <span style="color: #67D9F0;">push</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">item</span>) {
    <span style="color: #FA2573;">this</span>.items.unshift(item)
    <span style="color: #C48DFF;">if</span> (<span style="color: #FA2573;">this</span>.items.length &gt; <span style="color: #FA2573;">this</span>.max)
      <span style="color: #FA2573;">this</span>.items.pop() }
}

<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">spells</span> = boo.merge(ring, ring_data, {
  max: 2
})

spells.push(<span style="color: #A6E32D;">'Watera'</span>)
spells.push(<span style="color: #A6E32D;">'Blizarra'</span>)
spells.push(<span style="color: #A6E32D;">'Firaga'</span>)
spells.items
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; ['Firaga', 'Blizarra']</span>
ring_data.items
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; []</span>

boo.extend(spells, [ring_data])
spells.items
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; []</span>
spells.max
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; 3</span>
</pre>



</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Inheritance</h3>
<div class="outline-text-3" id="text-2-2">


<p>
For inheritance, <code>Boo</code> just defines a thin layer over the standard
<code>Object.create</code> method, such that it accepts mixins rather than property
descriptors — which are way too verbose to be practical.
</p>
<p>
The primitive <code>derive</code> is used for coupling inheritance and extension:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">Collection</span> = {
  <span style="color: #67D9F0;">pop</span>: <span style="color: #C48DFF;">function</span>(){
    <span style="color: #C48DFF;">return</span> <span style="color: #FA2573;">this</span>.items.pop() },

  <span style="color: #67D9F0;">push</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">item</span>){
    <span style="color: #FA2573;">this</span>.items.push(item) },

  <span style="color: #67D9F0;">each</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">fn</span>) {
    <span style="color: #FA2573;">this</span>.items.forEach(fn) },

  <span style="color: #67D9F0;">map</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">fn</span>) {
    <span style="color: #C48DFF;">return</span> <span style="color: #FA2573;">this</span>.items = <span style="color: #FA2573;">this</span>.items.map(fn) }
}

<span style="color: #75766A;">// </span><span style="color: #75766A;">Clones the `collection' behaviours and extends the clone with the</span>
<span style="color: #75766A;">// </span><span style="color: #75766A;">`ring' behaviours</span>
<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">RingCollection</span> = boo.derive(Collection, ring)
<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">spells</span>         = boo.derive(RingCollection, ring_data)

RingCollection.isPrototypeOf(spells)
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; true</span>

spells.push(<span style="color: #A6E32D;">'Agi'</span>)
spells.push(<span style="color: #A6E32D;">'Dia'</span>)
spells.push(<span style="color: #A6E32D;">'Patra'</span>)
spells.push(<span style="color: #A6E32D;">'Recarm'</span>)
spells.map(<span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">spell</span>){ <span style="color: #C48DFF;">return</span> spell.toUpperCase() })
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; ['RECARM', 'PATRA', 'DIA']</span>
</pre>



</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Syntactical sugar</h3>
<div class="outline-text-3" id="text-2-3">


<p>
Last but not least, <code>Boo</code> gives the developer nice object-oriented
syntactical sugar to write all of this in a nice sort-of declarative
syntax, which is easier to read and reason about.
</p>
<p>
The base object is <code>Base</code>, which can be cloned through <code>derive</code> and
instantiated with <code>make</code>, although both use cloning in the prototypical
sense:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">Enum</span> = boo.Base.derive({
  <span style="color: #67D9F0;">each</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">fn</span>) {
    <span style="color: #FA2573;">this</span>.items.forEach(fn) },

  <span style="color: #67D9F0;">filter</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">fn</span>) {
    <span style="color: #C48DFF;">return</span> <span style="color: #FA2573;">this</span>.items = <span style="color: #FA2573;">this</span>.items.filter(fn) },

  <span style="color: #67D9F0;">map</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">fn</span>) {
    <span style="color: #C48DFF;">return</span> <span style="color: #FA2573;">this</span>.items = <span style="color: #FA2573;">this</span>.items.map(fn) },

  <span style="color: #67D9F0;">fold</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">fn</span>, <span style="color: #729FCF;">start</span>) {
    <span style="color: #C48DFF;">return</span> <span style="color: #FA2573;">this</span>.items.reduce(fn, start) }
})

<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">Coll</span> = Enum.derive({
  <span style="color: #67D9F0;">push</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">item</span>) {
    <span style="color: #FA2573;">this</span>.items.push(item) },

  <span style="color: #67D9F0;">pop</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">item</span>) {
    <span style="color: #FA2573;">this</span>.items.pop(item) },

  <span style="color: #67D9F0;">has_p</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">item</span>) {
    <span style="color: #C48DFF;">return</span> <span style="color: #FA2573;">this</span>.find(item) != -1 },

  <span style="color: #67D9F0;">find</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">item</span>) {
    <span style="color: #C48DFF;">return</span> <span style="color: #FA2573;">this</span>.items.indexOf(item) }
})

<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">my_coll</span> = Coll.make()
my_coll.items = [1, 2, 3]
my_coll.map(<span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">n</span>){ <span style="color: #C48DFF;">return</span> n * n })
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; [1, 4, 9]</span>
my_coll.find(4)
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; 1</span>
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">What's next?</h2>
<div class="outline-text-2" id="text-3">


<p>
<code>Boo</code>'s source code is all on <a href="http://github.com/robotlolita/boo">Github</a>:
</p>



<pre class="src src-shell-script">$ git clone http://github.com/robotlolita/boo.git
</pre>


<p>
Though, if you want a quick'n'dirty install, just get it from NPM:
</p>



<pre class="src src-shell-script">$ npm install boo
node&gt; var boo = require(<span style="color: #A6E32D;">'boo'</span>)
node&gt; var Stuff = boo.Base.derive({ ... })
</pre>



</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Future developments?</h2>
<div class="outline-text-2" id="text-4">


<p>
Next release of <code>Boo</code> will include traits, and should be up around
December. Traits are more interesting for structuring larger programs
than mixins are, but I have yet to experiment with them more until I can
stick with a nice API :3
</p>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Acknowledgements</h2>
<div class="outline-text-2" id="text-5">


<p>
Thanks for <code>AdamR</code> in the comments and <code>xivix</code> on Freenode's
<code>##javascript</code> channel for pointing out the issue with Object.create on
the first snippet.
</p></div>
</div>
